Revit 2027 API
BuiltInFailures.LoadFailures.LineLoadNotOverlappingHost Property
 Line load is not overlapping with its entire distribution its host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LineLoadNotOverlappingHost { get; }
Public Shared ReadOnly Property LineLoadNotOverlappingHost As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LineLoadNotOverlappingHost {
	FailureDefinitionId^ get ();
}
static member LineLoadNotOverlappingHost : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.LoadFailures Class
Autodesk.Revit.DB Namespace